AverageJoel/iot_crockpot/firmware/sdkconfig.defaults
# IoT Crockpot default configuration
# Target: Seeed Studio XIAO ESP32-C3 (RISC-V, 4MB flash, no PSRAM)
#
# To build:
#   idf.py set-target esp32c3
#   idf.py menuconfig   (set WiFi/Telegram credentials under "IoT Crockpot")
#   idf.py build
#   idf.py -p COM<N> flash monitor

CONFIG_IDF_TARGET="esp32c3"

# Flash (4MB) — use the choice bool, not the string, to override the C3 default of 2MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# No PSRAM on XIAO ESP32-C3

# UART console via CH340C USB-UART bridge (GPIO20=TXD, GPIO21=RXD)
# Do NOT use GPIO20/21 for display or other peripherals.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# HTTPS support for Telegram API
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384

# Task watchdog
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# LVGL
# 16-bit RGB565 color depth — matches ST7796 SPI panel
CONFIG_LV_COLOR_DEPTH_16=y
# esp_lvgl_port task stack (default 4KB is tight with LVGL v9; 8KB is safe)
CONFIG_LVGL_PORT_TASK_STACK_SIZE=8192
# Montserrat fonts used by gui.c (14 is usually on by default; enable extras)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# Mock hardware — no MAX31855 or relay on XIAO test rig
CONFIG_CROCKPOT_MOCK_TEMPERATURE=y
CONFIG_CROCKPOT_MOCK_RELAY=y

# Smaller LVGL draw buffer — 20 lines × 480px × 2B = ~19KB (safe for C3 SRAM)
CONFIG_CROCKPOT_LCD_DRAW_BUFFER_LINES=20
